### Loading the libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

#### Loading the libraries

In [2]:
df = pd.read_csv('hiring.csv')

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
# here we can see that first two value of expirence is missing and also experience is in word
# also test score has missing values

### Converting experience words to number

In [5]:
#from word2number import w2n

In [6]:
pip install word2number

Requirement already satisfied: word2number in c:\users\admin\appdata\local\continuum\anaconda3\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [8]:
df.experience = df.experience.fillna('zero')

In [9]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [10]:
from word2number import w2n

In [11]:
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [13]:
import math
mean= math.floor(df['test_score(out of 10)'].mean())
mean

7

In [16]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(mean)

In [17]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [19]:
from sklearn import linear_model

In [20]:
reg = linear_model.LinearRegression()

In [24]:
reg.fit(df[['experience','test_score(out of 10)', 'interview_score(out of 10)']], df['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [25]:
reg.predict([[2,9,6]])

array([53713.86677124])

In [26]:
reg.predict([[12,10,10]])

array([93747.79628651])